bouffalolab/bl_iot_sdk-components/platform/soc/bl702/bl702_ethernet/Src/eth_bd.c
static int _emac_phy_setNegotiationConfig(ETHPHY_CFG_Type *cfg)
{
    uint32_t tmpVal;

    /* Set MAC duplex config */
    tmpVal=BL_RD_REG(EMAC_BASE, EMAC_MODE);
    tmpVal=BL_SET_REG_BITS_VAL(tmpVal,EMAC_FULLD,cfg->duplex);
    BL_WR_REG(EMAC_BASE, EMAC_MODE,tmpVal);

    return SUCCESS;
}

static int _emac_phy_linkup(ETHPHY_CFG_Type *cfg)
{
    emac_phy_linkup(cfg);

    return SUCCESS;
}

static int _emac_phy_linkstatus(void)
{
    uint16_t phy_bsr = 0;

    //puts("Read link\r\n");
    if (SUCCESS != emac_phy_read(PHY_BSR, &phy_bsr)) {
        printf("%s:%d\r\n", __func__, __LINE__);
        return ERROR;
    }

    if (!(PHY_LINKED_STATUS & phy_bsr)) {
        printf("%s:%d\r\n", __func__, __LINE__);
        return ERROR;
    }


    return SUCCESS;
}

static void _emac_phy_if_init(void)
{
#define EMAC_PHY_INIT_STEP_RESET                (0)
#define EMAC_PHY_INIT_STEP_NEGOTIATION          (1)
#define EMAC_PHY_INIT_STEP_CONFIG               (2)
#define EMAC_PHY_INIT_STEP_LINKUP               (3)
#define EMAC_PHY_INIT_STEP_SERCIVE_START        (4)
#define EMAC_PHY_INIT_STEP_LINKMAINTAIN         (5)
    static int internal_status = 0;

    int err = SUCCESS;
	static ETHPHY_CFG_Type phyCfg={
		.autoNegotiation=ENABLE,                    /*!< Speed and mode auto negotiation */
		.duplex=EMAC_MODE_FULLDUPLEX,             /*!< Duplex mode */
		.speed=EMAC_SPEED_100M,                   /*!< Speed mode */
		.phyAddress=0x1,                            /*!< PHY address */
	};

    //log_info("_emac_phy_if_init.\r\n");
    switch (internal_status) {
        case EMAC_PHY_INIT_STEP_RESET:
        {
            log_info("EMAC_PHY_INIT_STEP_RESET.\r\n");
            {
#if 0
                bl_gpio_enable_output(9, 1, 0);
                aos_msleep(10);
                bl_gpio_output_set(9, 0);
                aos_msleep(10);
                bl_gpio_output_set(9, 1);
                aos_msleep(10);
#endif
            }
            err = emac_phyinit(&phyCfg);
            if(err != SUCCESS)
            {
                log_info("emac_phyinit init err[%d].\r\n", err);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_NEGOTIATION:
        {
            log_info("EMAC_PHY_INIT_STEP_NEGOTIATION.\r\n");
            err = _emac_phy_autonegotiation(&phyCfg);
            if(err != SUCCESS)
            {
                log_info("EMAC_PHY_INIT_STEP_NEGOTIATION err[%d].\r\n", err);
                return;
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_CONFIG:
        {
            log_info("EMAC_PHY_INIT_STEP_CONFIG.\r\n");
            err = _emac_phy_setNegotiationConfig(&phyCfg);
            if(err != SUCCESS){
                log_info("EMAC_PHY_INIT_STEP_CONFIG err[%d].\r\n", err);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_LINKUP:
        {
            log_info("EMAC_PHY_INIT_STEP_LINKUP.\r\n");
            err = _emac_phy_linkup(&phyCfg);
            log_info("speed %d\r\n", phyCfg.speed);
            if(TIMEOUT==err){
                MSG("PHY Init timeout\r\n");
                while(1);
            }
            if(ERROR==err){
                MSG("PHY Init error\r\n");
                while(1);
            }
            if(phyCfg.duplex==EMAC_MODE_FULLDUPLEX){
                MSG("EMAC_MODE_FULLDUPLEX\r\n");
            }else{
                MSG("EMAC_MODE_HALFDUPLEX\r\n");
            }
            if(phyCfg.speed==EMAC_SPEED_100M){
                MSG("EMAC_SPEED_100M\r\n");
            }else{
                MSG("EMAC_SPEED_50M\r\n");
            }
            MSG("PHY Init done\r\n");
            if(p_eth_callback){
                p_eth_callback(ETH_INIT_STEP_LINKUP);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_SERCIVE_START:
        {
            log_info("EMAC_PHY_INIT_STEP_SERCIVE_START start dhcp...\r\n");
            if(p_eth_callback){
                p_eth_callback(ETH_INIT_STEP_READY);
            }
            internal_status++;
        }
        break;
        case EMAC_PHY_INIT_STEP_LINKMAINTAIN:
        {
            //log_info("EMAC_PHY_INIT_STEP_LINKMAINTAIN.\r\n");
            _emac_phy_linkstatus();
        }
        break;
        default:
        {
            log_info("emac unkonwn internal status\r\n");
        }
    }
}

void borad_eth_init(void)
{
    EMAC_CFG_Type emacCfg={
        .recvSmallFrame=ENABLE,                     /*!< Receive small frmae or not */
        .recvHugeFrame=DISABLE,                     /*!< Receive huge frmae(>64K bytes) or not */
        .padEnable=ENABLE,                          /*!< Enable padding for frame which is less than MINFL or not */
        .crcEnable=ENABLE,                          /*!< Enable hardware CRC or not */
        .noPreamble=DISABLE,                        /*!< Enable preamble or not */
        .recvBroadCast=ENABLE,                      /*!< Receive broadcast frame or not */
        .interFrameGapCheck=ENABLE,                 /*!< Check inter frame gap or not */
        .miiNoPreamble=ENABLE,                      /*!< Enable MII interface preamble or not */
        .miiClkDiv=49,                              /*!< MII interface clock divider from bus clock */
        .maxTxRetry=16,                             /*!< Maximum tx retry count */
        .interFrameGapValue=24,                     /*!< Inter frame gap vaule in clock cycles(default 24)*/
        .minFrameLen=64,                            /*!< Minimum frame length */
        .maxFrameLen=ETH_MAX_BUFFER_SIZE,           /*!< Maximum frame length */
        .collisionValid=16,                         /*!< Collision valid value */
        .macAddr[0]=0x18,                           /*!< MAC Address */
        .macAddr[1]=0xB0,                          
        .macAddr[2]=0x09,
        .macAddr[3]=0x00,
        .macAddr[4]=0x12,
        .macAddr[5]=0x34,
    };

